In [25]:
import numpy as np
import pandas as pd
from datetime import datetime

In [7]:
area = pd.Series({'California':423967, 'Texas': 695662, 'NY': 141297, 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California':38332521, 'Texas': 26448193, 'Florida': 19552860, 'Illinois': 12882135})
df= pd.DataFrame({'population':pop, 'area':area}, index = ['California', 'Texas', 'NY', 'Florida', 'Illinois'])
df

            population    area
California  38332521.0  423967
Texas       26448193.0  695662
NY                 NaN  141297
Florida     19552860.0  170312
Illinois    12882135.0  149995

In [24]:
df1 = df.iloc[:4, :]
df2 = df.iloc[3:, :]
df1['density'] = df1['population'] / df1['area']
display(df1, df2)

C:\Users\ledegra\AppData\Local\Temp\ipykernel_16052\2308168293.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['density'] = df1['population'] / df1['area']

            population    area     density
California  38332521.0  423967   90.413926
Texas       26448193.0  695662   38.018740
NY                 NaN  141297         NaN
Florida     19552860.0  170312  114.806121

          population    area
Florida   19552860.0  170312
Illinois  12882135.0  149995

In [21]:
pd.concat([df1, df2])

            population    area     density
California  38332521.0  423967   90.413926
Texas       26448193.0  695662   38.018740
NY                 NaN  141297         NaN
Florida     19552860.0  170312  114.806121
Florida     19552860.0  170312         NaN
Illinois    12882135.0  149995         NaN

In [23]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [29]:
tijdstip = datetime(1993, 7, 12, 22, 40)
print(tijdstip)

1993-07-12 22:40:00

In [42]:
tijdstip.strftime('%A, %d.%m.%Y')

'Monday, 12.07.1993'